DataProcessors/РаспределениеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>РаспределениеОбъектов</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДолговыхОбязательств</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДОНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженностиНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчаствуетВРаспределении</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкиАвтораспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАвтораспределения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиАвтораспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиАвтораспределения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчаствуетВРаспределении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/АктПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>АктПередачи</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначитьГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНазначатьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменялРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаспределениеОбъектов/Ext/ObjectModule.bsl
Процедура ЗаполнитьНастройкиРаспределения() Экспорт
	Набор = РегистрыСведений.НастройкиАвтораспределения.СоздатьМенеджерЗаписи();
	Набор.Ответственный = ЭтотОбъект.Ответственный;
	Набор.Прочитать();
	ЭтотОбъект.ВариантРаспределения = Набор.ВариантРаспределения;
	ЭтотОбъект.ТипСотрудника = Набор.ТипСотрудника;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СотрудникиАвтораспределения.Сотрудник,
	                      |	СотрудникиАвтораспределения.УчаствуетВРаспределении,
	                      |	КОЛИЧЕСТВО(ОбъектыВРаботеОстатки.Объект) КАК КоличествоОбъектов,
	                      |	СУММА(ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток) КАК СуммаЗадолженности
	                      |ИЗ
	                      |	РегистрСведений.СотрудникиАвтораспределения КАК СотрудникиАвтораспределения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(, Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	                      |			ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	                      |		ПО СотрудникиАвтораспределения.Сотрудник = ОбъектыВРаботеОстатки.Сотрудник
	                      |ГДЕ
	                      |	СотрудникиАвтораспределения.Ответственный = &Ответственный
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	СотрудникиАвтораспределения.Сотрудник,
	                      |	СотрудникиАвтораспределения.УчаствуетВРаспределении");
	Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Ответственный.Подразделение);
	Запрос.УстановитьПараметр("Ответственный", ЭтотОбъект.Ответственный);
	ЭтотОбъект.Сотрудники.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Процедура ЗаполнитьТаблицуСДолговымиОбязательствами() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаЗадолженности
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностьПоОбъектам.Остатки КАК ЗадолженностьПоОбъектамОстатки
	                      |		ПО ОбъектыВРаботеОстатки.Объект = ЗадолженностьПоОбъектамОстатки.Объект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(*) = 1");
	Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Ответственный.Подразделение);
	ЭтотОбъект.Объекты.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры


Функция ВыполнитьРаспределение() Экспорт
	Если ЭтотОбъект.ВариантРаспределения.Пустая() Тогда
		ЭтотОбъект.ВариантРаспределения = Перечисления.ВариантыРаспределенияДолжников.ПоровнуПоКоличеству;			
	КонецЕсли;
	Если ЭтотОбъект.Сотрудники.НайтиСтроки(Новый Структура("УчаствуетВРаспределении", Истина)).Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Элемент Из ЭтотОбъект.Сотрудники Цикл
		Элемент.КоличествоДОНовое = Элемент.КоличествоДолговыхОбязательств;
		Элемент.СуммаЗадолженностиНовое = Элемент.СуммаЗадолженности;
	КонецЦикла;
	Для Каждого Элемент Из ЭтотОбъект.Объекты Цикл
		Элемент.НовыйСотрудник = Неопределено;
	КонецЦикла;
	
	Если ЭтотОбъект.ВариантРаспределения = Перечисления.ВариантыРаспределенияДолжников.ПоровнуПоКоличеству Тогда	
		ДолговоеОбязательство = НайтиДолговоеОбязательствоСМаксимальнойЗадолженностью();
		Пока ДолговоеОбязательство <> Неопределено Цикл			
			Сотрудник = ПолучитьТекущегоОтветственногоДО(ДолговоеОбязательство);
			ПрибавлятьКоличествоДО = Ложь;
			Если Сотрудник = Неопределено Тогда
				Сотрудник = НайтиСотрудникаСМинимальнойНагрузкойПоКоличеству();
				ПрибавлятьКоличествоДО = Истина;
			КонецЕсли;
			ПрисвоитьСотрудникуДО(Сотрудник, ДолговоеОбязательство, ПрибавлятьКоличествоДО);		
			ДолговоеОбязательство = НайтиДолговоеОбязательствоСМаксимальнойЗадолженностью();
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ВариантРаспределения = Перечисления.ВариантыРаспределенияДолжников.ПоровнуПоСуммеДолга Тогда 
		ДолговоеОбязательство = НайтиДолговоеОбязательствоСМаксимальнойЗадолженностью();
		Пока ДолговоеОбязательство <> Неопределено Цикл
			Сотрудник = ПолучитьТекущегоОтветственногоДО(ДолговоеОбязательство);
			ПрибавлятьКоличествоДО = Ложь;
			Если Сотрудник = Неопределено Тогда
				Сотрудник = НайтиСотрудникаСМинимальнойНагрузкойПоСумме();
				ПрибавлятьКоличествоДО = Истина;
			КонецЕсли;
			ПрисвоитьСотрудникуДО(Сотрудник, ДолговоеОбязательство, ПрибавлятьКоличествоДО);		
			ДолговоеОбязательство = НайтиДолговоеОбязательствоСМаксимальнойЗадолженностью();
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Истина;
КонецФункции

Функция НайтиДолговоеОбязательствоСМаксимальнойЗадолженностью()
	Строки = ЭтотОбъект.Объекты.НайтиСтроки(Новый Структура("НовыйСотрудник", Справочники.Пользователи.ПустаяСсылка()));
	ДолговоеОбязательство = Неопределено;
	СуммаМакс = 0;
	Для Каждого Элемент Из Строки Цикл		
		Если ДолговоеОбязательство = Неопределено ИЛИ Элемент.СуммаЗадолженности > СуммаМакс Тогда
			ДолговоеОбязательство = Элемент.Объект;
			СуммаМакс = Элемент.СуммаЗадолженности;
		КонецЕсли;
	КонецЦикла;	
	Возврат ДолговоеОбязательство;
КонецФункции

Функция НайтиСотрудникаСМинимальнойНагрузкойПоКоличеству()
	Сотрудник = Неопределено;
	КолМин = 0;
	СуммаМин = 0;
	Для Каждого Элемент Из ЭтотОбъект.Сотрудники.НайтиСтроки(Новый Структура("УчаствуетВРаспределении", Истина)) Цикл
		Если Сотрудник = Неопределено ИЛИ Элемент.КоличествоДОНовое < КолМин ИЛИ 
				(Элемент.КоличествоДОНовое = КолМин И Элемент.СуммаЗадолженностиНовое < СуммаМин) Тогда
			Сотрудник = Элемент.Сотрудник;
			КолМин = Элемент.КоличествоДОНовое;
			СуммаМин = Элемент.СуммаЗадолженностиНовое;
		КонецЕсли;
	КонецЦикла;
	Возврат Сотрудник;	
КонецФункции

Функция НайтиСотрудникаСМинимальнойНагрузкойПоСумме()
	Сотрудник = Неопределено;
	КолМин = 0;
	СуммаМин = 0;
	Для Каждого Элемент Из ЭтотОбъект.Сотрудники.НайтиСтроки(Новый Структура("УчаствуетВРаспределении", Истина)) Цикл
		Если Сотрудник = Неопределено ИЛИ Элемент.СуммаЗадолженностиНовое < СуммаМин ИЛИ 
				(Элемент.СуммаЗадолженностиНовое = СуммаМин И Элемент.КоличествоДОНовое < КолМин) Тогда
			Сотрудник = Элемент.Сотрудник;
			КолМин = Элемент.КоличествоДОНовое;
			СуммаМин = Элемент.СуммаЗадолженностиНовое;
		КонецЕсли;
	КонецЦикла;
	Возврат Сотрудник;
КонецФункции

Функция ПолучитьТекущегоОтветственногоДО(ДолговоеОбязательство)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Сотрудник КАК Ответственный
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Объект = &ДО) КАК ОбъектыВРаботеОстатки");
	Запрос.УстановитьПараметр("ДО", ДолговоеОбязательство);
	Результат = Запрос.Выполнить().Выбрать();
	Сотрудник = Неопределено;
	Пока Результат.Следующий() Цикл
		Строки = ЭтотОбъект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", Результат.Ответственный));
		Если Строки.Количество() > 0 Тогда
			Сотрудник = Результат.Ответственный;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Сотрудник;
КонецФункции

Процедура ПрисвоитьСотрудникуДО(Сотрудник, ДолговоеОбязательство, ПрибавлятьКоличествоДО)
	СтрокаДО = ЭтотОбъект.Объекты.НайтиСтроки(Новый Структура("Объект", ДолговоеОбязательство))[0];
	СтрокаСотрудника = ЭтотОбъект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник))[0];
	
	СтрокаДО.НовыйСотрудник = Сотрудник;
	Если ПрибавлятьКоличествоДО Тогда
		СтрокаСотрудника.КоличествоДОНовое = СтрокаСотрудника.КоличествоДОНовое + 1;
		СтрокаСотрудника.СуммаЗадолженностиНовое = СтрокаСотрудника.СуммаЗадолженностиНовое + СтрокаДО.СуммаЗадолженности;
	КонецЕсли;
КонецПроцедуры


Процедура ПередатьСотрудникам(Отказ = Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаДолжников.Объект,
	                      |	ТаблицаДолжников.НовыйСотрудник
	                      |ПОМЕСТИТЬ ТаблицаДолжников
	                      |ИЗ
	                      |	&ВыбранныеОбъекты КАК ТаблицаДолжников
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	МАКСИМУМ(ЕСТЬNULL(ОбъектыВРаботеОстатки.Сотрудник, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))) КАК Ответственный,
	                      |	ТаблицаДолжников.Объект,
	                      |	ТаблицаДолжников.НовыйСотрудник КАК НовыйСотрудник
	                      |ИЗ
	                      |	ТаблицаДолжников КАК ТаблицаДолжников
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОбъектыВРаботе.Остатки(&Момент, Подразделение = &Подразделение) КАК ОбъектыВРаботеОстатки
	                      |		ПО ТаблицаДолжников.Объект = ОбъектыВРаботеОстатки.Объект
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТаблицаДолжников.Объект,
	                      |	ТаблицаДолжников.НовыйСотрудник
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ответственный,
	                      |	НовыйСотрудник
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |УНИЧТОЖИТЬ ТаблицаДолжников");
						  
	Запрос.УстановитьПараметр("ВыбранныеОбъекты", ЭтотОбъект.Объекты.Выгрузить());
	Запрос.УстановитьПараметр("Момент", Новый Граница(КонецДня(ТекущаяДата()), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Подразделение", ЭтотОбъект.Подразделение);	
	Результат = Запрос.ВыполнитьПакет();
	ТЗ = Результат[1].Выгрузить();
	
	ДокументОбъект = Неопределено;
	СтарыйОтветственный = Неопределено;
	НовыйОтветственный = Неопределено; 
	Для Каждого Элемент Из ТЗ Цикл
		Если Элемент.Ответственный = Элемент.НовыйСотрудник Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтарыйОтветственный <> Элемент.Ответственный ИЛИ НовыйОтветственный <> Элемент.НовыйСотрудник Тогда
			Если ДокументОбъект <> Неопределено Тогда
				Попытка
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Отказ = Истина;
					Возврат;
				КонецПопытки;
			КонецЕсли;
			ДокументОбъект = Документы.АктПередачи.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДата();
			ДокументОбъект.Организация = Элемент.НовыйСотрудник.Организация;
			//ДокументОбъект.СотрудникПередающий = Элемент.Ответственный;
			ДокументОбъект.СотрудникПринимающий = Элемент.НовыйСотрудник;
			//ДокументОбъект.ПодразделениеПередающее = Элемент.Ответственный.Подразделение;
			ДокументОбъект.ПодразделениеПринимающее = Элемент.НовыйСотрудник.Подразделение;
			ДокументОбъект.Автор = ЭтотОбъект.Автор;
			ДокументОбъект.ТипСотрудникаПринимающего = ТипСотрудника;
		КонецЕсли;		
		ДокументОбъект.Объекты.Добавить().Объект = Элемент.Объект;		
	КонецЦикла;
	
	Если ДокументОбъект <> Неопределено Тогда
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
